Revit 2026 API

# DoubleClickTarget Enumeration

---

Elements that support double-click in Revit. Note that this is meant to cover cases where the element itself is a double-click target. Individual controls that are targets are handled separately.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DoubleClickTarget
```
```vb
Public Enumeration DoubleClickTarget
```
```cpp
public enum class DoubleClickTarget
```
```fsharp
type DoubleClickTarget
```

| Member name | Value | Description |
| --- | --- | --- |
| Assembly | 3 | Assemblies |
| ComponentStairs | 5 | Component-based stairs |
| Family | 0 | Family instances |
| Group | 4 | Groups |
| OutsideViewOnSheet | 6 | Outside active view on sheet |
| SketchedElement | 1 | Sketch-based elements |
| ViewOnSheet | 2 | Views on sheets |

#### Reference

Autodesk.Revit.UI Namespace